devdnl/dnx-rtos/src/system/drivers/eth/stm32fx/eth.c
        return err;
}

//==============================================================================
/**
 * @brief  Send packet.
 *
 * @param  hdl          device handle
 * @param  pkt          packet
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
static int packet_send(struct eth *hdl, const ETH_packet_t *pkt)
{
        int err = hdl->run ? ESUCC : EPERM;

        clock_t tref = sys_get_uptime_ms();

        while (true) {
                err = sys_mutex_lock(hdl->mutex, MUTEX_TIMEOUT);
                if (!err) {

                        __IO ETH_DMADescTypeDef *DmaTxDesc = hdl->eth.TxDesc;

                        _cpuctl_invalidate_dcache_by_addr((uint32_t*)DmaTxDesc, sizeof(ETH_DMADescTypeDef));

                        if ((DmaTxDesc->Status & ETH_DMATXDESC_OWN) != (uint32_t) RESET) {
                                sys_mutex_unlock(hdl->mutex);

                                if (sys_is_time_expired(tref, hdl->tx_timeout_ms)) {
                                        err = ETIME;
                                        break;
                                }

                                sys_sleep_ms(10);
                                continue;
                        }

                        /* Copy the remaining bytes */
                        uint8_t *buffer = (uint8_t*) (DmaTxDesc->Buffer1Addr);
                        memcpy(buffer, pkt->payload, pkt->length);

                        _cpuctl_clean_dcache_by_addr((uint32_t*)buffer, pkt->length);

                        /* Prepare transmit descriptors to give to DMA */
                        err = HAL_ETH_TransmitFrame(&hdl->eth, pkt->length);

                        /* When Transmit Underflow flag is set, clear it and issue a Transmit Poll Demand to resume transmission */
                        if ((hdl->eth.Instance->DMASR & ETH_DMASR_TUS) != (uint32_t) RESET) {
                                /* Clear TUS ETHERNET DMA flag */
                                hdl->eth.Instance->DMASR = ETH_DMASR_TUS;

                                /* Resume DMA transmission*/
                                hdl->eth.Instance->DMATPDR = 0;
                        }

                        /* update statistics */
                        update_dropped_rx_frames(hdl);
                        hdl->stats.tx_packets++;
                        hdl->stats.tx_bytes += pkt->length;

                        sys_mutex_unlock(hdl->mutex);
                }

                break;
        }

        return err;
}

//==============================================================================
/**
 * @brief  Receive packet.
 *
 * @param  hdl          device handle
 * @param  pkt          packet data
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
static int packet_receive(struct eth *hdl, ETH_packet_t *pkt)
{
        int err = hdl->run ? ESUCC : EPERM;

        clock_t tref = sys_get_uptime_ms();

        while (!err) {
                sys_thread_yield();

                err = sys_mutex_lock(hdl->mutex, MUTEX_TIMEOUT);
                if (!err) {
                        /* get received frame */
                        if (HAL_ETH_GetReceivedFrame_IT(&hdl->eth) != HAL_OK) {
                                sys_mutex_unlock(hdl->mutex);

                                if (sys_is_time_expired(tref, hdl->rx_timeout_ms)) {
                                        err = ETIME;
                                        break;
                                }

                                sys_semaphore_wait(hdl->rx_semaphore, 100);
                                continue;
                        }

                        /* Obtain the size of the packet and put it into the "len" variable. */
                        uint16_t len = hdl->eth.RxFrameInfos.length;
                        uint8_t *buffer = (uint8_t*)hdl->eth.RxFrameInfos.buffer;

                        if (len > 0) {
                                pkt->length = len;
                                _cpuctl_invalidate_dcache_by_addr((uint32_t*)buffer, len);
                                memcpy(pkt->payload, buffer, min(pkt->length, len));
                        }

                        /* Release descriptors to DMA */
                        __IO ETH_DMADescTypeDef *dmarxdesc = hdl->eth.RxFrameInfos.FSRxDesc;

                        /* Set Own bit in Rx descriptors: gives the buffers back to DMA */
                        for (u32_t i = 0; i < hdl->eth.RxFrameInfos.SegCount; i++) {
                                dmarxdesc->Status |= ETH_DMARXDESC_OWN;
                                _cpuctl_clean_dcache_by_addr((uint32_t*)dmarxdesc, sizeof(ETH_DMADescTypeDef));
                                dmarxdesc = (ETH_DMADescTypeDef*)(dmarxdesc->Buffer2NextDescAddr);
                        }

                        /* Clear Segment_Count */
                        hdl->eth.RxFrameInfos.SegCount = 0;

                        /* When Rx Buffer unavailable flag is set: clear it and resume reception */
                        if ((hdl->eth.Instance->DMASR & ETH_DMASR_RBUS) != (uint32_t) RESET) {
                                /* Clear RBUS ETHERNET DMA flag */
                                hdl->eth.Instance->DMASR = ETH_DMASR_RBUS;
                                /* Resume DMA reception */
                                hdl->eth.Instance->DMARPDR = 0;
                        }

                        /* update statistics */
                        update_dropped_rx_frames(hdl);
                        hdl->stats.rx_packets++;
                        hdl->stats.rx_bytes += len;

                        sys_mutex_unlock(hdl->mutex);
                }

                break;
        }

        return err;
}

//==============================================================================
/**
 * @brief  Low level Ethernet initialization (library callback).
 *
 * @param  heth         hal ethernet handler
 */
//==============================================================================
void HAL_ETH_MspInit(ETH_HandleTypeDef *heth)
{
        UNUSED_ARG1(heth);

        /* Enable the Ethernet global Interrupt */
        NVIC_SetPriority(ETH_IRQn, _CPU_IRQ_SAFE_PRIORITY_);
        NVIC_EnableIRQ(ETH_IRQn);

